# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11n + Relationship Detection model
# This config adds relationship detection capabilities on top of YOLO11n object detection
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Base model to inherit from
base_model: yolo11n.pt

# Parameters
nc: 133 # number of object classes (PSG dataset has 133 object classes)
relation_classes: 56 # number of relation classes (PSG dataset has 56 relations)

# Relationship detection specific parameters
relation_params:
  feat_dim: 512        # Feature dimension for relationship attention
  top_k: 100          # Number of top relationship pairs to consider
  temperature: 8.0    # Temperature for attention scaling
  hidden_dim: 256     # Hidden dimension for relationship classifier
  dropout: 0.1        # Dropout rate for relationship head

# Training parameters specific to relations
relation_training:
  pos_weight: 10.0    # Positive weight for BCE loss (relations are sparse)
  neg_weight: 1.0     # Negative weight for BCE loss
  relation_loss_weight: 1.0  # Weight for relationship loss vs detection loss

# Model compound scaling constants - inherited from base YOLO11
scales: # model compound scaling constants, i.e. 'model=yolo11n-rel.yaml' will call yolo11n-rel.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: ~181 layers + relation head
  s: [0.50, 0.50, 1024] # summary: ~181 layers + relation head  
  m: [0.50, 1.00, 512]  # summary: ~231 layers + relation head
  l: [1.00, 1.00, 512]  # summary: ~357 layers + relation head
  x: [1.00, 1.50, 512]  # summary: ~357 layers + relation head

# YOLO11n backbone (inherited from base model)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n detection head + Relationship head
head:
  # Standard YOLO detection head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  # Detection head - outputs object detections and features for relationships
  - [[16, 19, 22], 1, RelationHead, [nc, relation_classes]] # 23 - Unified detection + relationship head (P3, P4, P5)

# Task type
task: relation
